In [2]:
#Target guided oridinal encoding

In [16]:
import pandas as pd

df =pd.DataFrame({
    'city' : ['new_york','Dubai','new_york','Dubai','paris'],
    'price' : [230,290,200,302,422]
})
df.head()

       city  price
0  new_york    230
1     Dubai    290
2  new_york    200
3     Dubai    302
4     paris    422

In [17]:
# calcalate the mean price for each city
mean_price =df.groupby('city')['price'].mean().to_dict()
mean_price

{'Dubai': 296.0, 'new_york': 215.0, 'paris': 422.0}

In [18]:
df['city_encoded'] =df['city'].map(mean_price)

In [19]:
df

       city  price  city_encoded
0  new_york    230         215.0
1     Dubai    290         296.0
2  new_york    200         215.0
3     Dubai    302         296.0
4     paris    422         422.0

In [22]:
import seaborn as sns
df1 = sns.load_dataset('tips')
df1.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [37]:
mean_of_tips =df1.groupby('sex')['tip'].mean().to_dict()
mean_of_tips

{'Male': 3.0896178343949043, 'Female': 2.833448275862069}

In [35]:
del df1['mean_of_total_bill']

In [38]:
df1['mean_of_tips'] = df1['sex'].map(mean_of_tips)
df1.head()

   total_bill   tip     sex smoker  day    time  size mean_of_tips
0       16.99  1.01  Female     No  Sun  Dinner     2     2.833448
1       10.34  1.66    Male     No  Sun  Dinner     3     3.089618
2       21.01  3.50    Male     No  Sun  Dinner     3     3.089618
3       23.68  3.31    Male     No  Sun  Dinner     2     3.089618
4       24.59  3.61  Female     No  Sun  Dinner     4     2.833448